"Dismiss" = "Отклонить";
"Welcome to Mover! To start, add a few items to the table by touching \U201c+\U201d, then slide them off to nearby iPhones and iPods." = "Добро пожаловать в Mover! Для начала, добавьте несколько элементов на стол \U201c+\U201d и \"перекиньте\" их в нужный iPhone или iPod.";
"To see nearby devices, make sure they're all connected to the same Wi-Fi network as this one." = "Чтобы увидеть устройства, находящиеся поблизости, убедитесь, что все они находятся в одной и тойже сети Wi-Fi.";